tap "romkatv/powerlevel10k"

brew "awscli"
brew "bat"
brew "container"
brew "coreutils"
brew "direnv"
brew "findutils"
brew "gawk"
brew "gh"
brew "glab"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "hyperfine"
brew "jq"
brew "make"
brew "mise"
brew "openssh"
brew "powerlevel10k"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "yq"
brew "zoxide"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"

cask_args appdir: "~/Applications", require_sha: true

cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "iterm2"
cask "google-chrome"
cask "maccy"
cask "privileges"
cask "rectangle"
cask "secretive"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"

## App Store apps
mas "Amphetamine", id: 937984704

vscode "1password.op-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.markdown-mermaid"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "gitguardian-secret-security.gitguardian"
vscode "redhat.vscode-yaml"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "signageos.signageos-vscode-sops"
vscode "tyriar.sort-lines"
vscode "vscode-icons-team.vscode-icons"
